# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

In [3]:
cars_1_url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv"
cars_2_url = "https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv"

   ### Step 3. Assign each to a variable called cars1 and cars2

In [4]:
cars1 = pd.read_csv(cars_1_url)
cars2 = pd.read_csv(cars_2_url)

In [5]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [6]:
cars2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se
2,18.0,6,250,78,3574,21.0,76,1,ford granada ghia
3,18.5,6,250,110,3645,16.2,76,1,pontiac ventura sj
4,17.5,6,258,95,3193,17.8,76,1,amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [7]:
cars1.dropna(axis=1, how="any", inplace=True)

In [8]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [9]:
cars1.shape

(198, 9)

In [10]:
cars2.shape

(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [13]:
cars = pd.concat([cars1, cars2])

In [14]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [17]:
import numpy as np

In [22]:
owners = np.random.randint(15000, 73001, size=398)

In [23]:
owners

array([59283, 22559, 54455, 63323, 36793, 69447, 70362, 39882, 62395,
       25732, 45389, 64135, 71249, 62279, 62397, 45421, 59970, 41837,
       16192, 67490, 17408, 71325, 47619, 61667, 24095, 47307, 22624,
       71860, 38486, 44304, 56989, 23711, 44607, 15545, 20144, 34261,
       19490, 60188, 54288, 55615, 35437, 56713, 47872, 42000, 35345,
       70515, 49047, 50053, 60773, 62620, 18727, 23052, 60685, 67261,
       70243, 20697, 67842, 40389, 43585, 38770, 57122, 52351, 35969,
       36287, 25021, 36589, 51598, 70969, 56536, 69318, 20851, 44286,
       69354, 46364, 19149, 66021, 15437, 49373, 71295, 62730, 33400,
       20082, 28161, 29204, 67457, 71935, 25869, 54424, 45353, 55930,
       36381, 37667, 44897, 41333, 28771, 25967, 65177, 26113, 22839,
       26177, 69527, 41084, 57819, 40910, 50990, 20265, 25791, 30275,
       29615, 30589, 36544, 46375, 63793, 56819, 30003, 35389, 38480,
       52914, 32635, 30662, 59649, 57334, 28879, 18686, 39029, 36155,
       72216, 65098, 72829, 55247, 34331, 36175, 68013, 63220, 59071,
       53274, 24539, 53761, 20896, 26827, 68480, 29836, 46924, 51933,
       19662, 34927, 37180, 37265, 55116, 31091, 46590, 52417, 37785,
       15262, 66775, 18708, 56591, 32528, 44828, 30605, 47548, 22442,
       39701, 30049, 49821, 20928, 16356, 18446, 65235, 41748, 25266,
       59787, 45847, 22637, 54692, 70853, 46642, 53505, 21728, 20098,
       48954, 62614, 61964, 56117, 45751, 46586, 41264, 51419, 60986,
       15952, 68575, 72886, 23999, 70920, 41134, 58719, 18154, 61072,
       66590, 54373, 55374, 49434, 71336, 25428, 25688, 21953, 58569,
       40676, 50344, 30854, 18991, 31124, 70710, 65587, 66519, 31299,
       26246, 16577, 24278, 45078, 52271, 50719, 57599, 55055, 54892,
       31448, 35004, 40784, 45265, 40328, 42569, 41416, 67219, 16341,
       45918, 67726, 56244, 41314, 24574, 66609, 54834, 57741, 70071,
       22035, 18423, 20577, 22931, 45669, 45614, 69113, 36028, 45295,
       61949, 30877, 60659, 25190, 48212, 22138, 59366, 53582, 71927,
       38544, 34279, 67186, 71959, 35468, 19685, 22806, 72747, 33748,
       33720, 69514, 54225, 25868, 54708, 59126, 45742, 19479, 46784,
       50614, 72614, 39254, 51370, 71737, 24643, 34687, 19061, 39525,
       43809, 30975, 71223, 26918, 38844, 25480, 42545, 28388, 36315,
       28459, 46470, 32817, 57222, 36779, 26497, 22178, 52910, 70816,
       66016, 46595, 43638, 56464, 60293, 70220, 44613, 38249, 24271,
       25677, 20208, 26648, 63533, 43570, 52901, 67755, 61276, 48334,
       42704, 63389, 30723, 17350, 26933, 64621, 37651, 26572, 72951,
       49957, 40868, 21783, 40393, 68178, 31916, 27622, 46601, 20696,
       60291, 57912, 45645, 52917, 36311, 52521, 39930, 49996, 39440,
       32151, 18356, 59234, 48222, 69443, 59747, 25183, 27684, 28209,
       20648, 68910, 68046, 59475, 66196, 53556, 16039, 39807, 60231,
       20912, 55803, 54137, 36724, 36601, 52614, 25962, 62922, 41065,
       64658, 66952, 49101, 39193, 41903, 20917, 53060, 43225, 42187,
       50361, 49968, 16008, 35804, 27386, 24887, 22236, 34741, 46714,
       38588, 39149])

### Step 8. Add the column owners to cars

In [24]:
cars['owners'] = owners

In [25]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,59283
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,22559
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,54455
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,63323
4,17.0,8,302,140,3449,10.5,70,1,ford torino,36793